subset_id_path: ./subset_id/2015~2020-07-03.json
datasetDirs: ['./dataset/2015~2016/detect/', './dataset/2017-08-02/detect/', './dataset/2017-10-25/detect/', './dataset/2020-06-03/detect/', './dataset/2020-07-03/detect/']
walk: False
cutin_freq: 4000
spect_shape: (96, 96)
modelname: PhysicalCNN_CI
modelfolder_path: ./{PhysicalCNN_CI}/
PhysicalCNN_path: 
loglevel: INFO
logpath: ./{PhysicalCNN_CI}/logs/*.txt

DTYPE: float32
DATA_FORMAT: channels_last
BATCH_SIZE: 128
EPOCHS: 1000

1 Physical GPUs, 1 Logical GPUs

[train]
number of classes: 2
number of data: 4031
number of data in each class: {0 = 1252, 1 = 2779}
ratios of classes: {0 = 0.3106, 1 = 0.6894}
class_weight: {0 = 1.6098, 1 = 0.7253}

[valid]
number of classes: 2
number of data: 1330
number of data in each class: {0 = 555, 1 = 775}
ratios of classes: {0 = 0.4173, 1 = 0.5827}
class_weight: {0 = 1.1982, 1 = 0.8581}

[test]
number of classes: 2
number of data: 1663
number of data in each class: {0 = 469, 1 = 1194}
ratios of classes: {0 = 0.2820, 1 = 0.7180}
class_weight: {0 = 1.7729, 1 = 0.6964}


Training----------------
>> build model... 
Model: "physicalcnn-ci"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_sp (InputLayer)           [(None, 96, 96)]     0                                            
__________________________________________________________________________________________________
insert_channel_axis (InsertChan (None, 96, 96, 1)    0           input_sp[0][0]                   
__________________________________________________________________________________________________
split (Split_)                  [(None, 96, 32, 1),  0           insert_channel_axis[0][0]        
__________________________________________________________________________________________________
denoise3b (Functional)          [(None, 96, 32, 1),  61242       split[0][0]                      
                                                                 split[0][1]                      
                                                                 split[0][2]                      
                                                                 continuity[0][0]                 
                                                                 continuity[1][0]                 
                                                                 denoise3b[0][4]                  
__________________________________________________________________________________________________
continuity (MaskContinuity_)    (None, 96, 32, 1)    1           denoise3b[0][1]                  
                                                                 denoise3b[0][3]                  
                                                                 denoise3b[0][0]                  
                                                                 denoise3b[0][3]                  
                                                                 denoise3b[0][5]                  
                                                                 denoise3b[0][2]                  
__________________________________________________________________________________________________
identity (MaskIdentity_)        (None, 96, 32, 1)    1           denoise3b[1][1]                  
                                                                 continuity[0][0]                 
                                                                 denoise3b[1][3]                  
                                                                 continuity[1][0]                 
                                                                 denoise3b[1][5]                  
                                                                 denoise3b[0][4]                  
__________________________________________________________________________________________________
input_rs (InputLayer)           [(None,)]            0                                            
__________________________________________________________________________________________________
classifier3b (Functional)       [(None,), (None,), ( 194         identity[0][0]                   
                                                                 identity[1][0]                   
                                                                 identity[2][0]                   
                                                                 input_rs[0][0]                   
__________________________________________________________________________________________________
any_of_3 (AnyOf3_)              (None,)              0           classifier3b[0][0]               
                                                                 classifier3b[0][1]               
                                                                 classifier3b[0][2]               
==================================================================================================
Total params: 61,438
Trainable params: 61,128
Non-trainable params: 310
__________________________________________________________________________________________________
╒════╤═══════════════════════════════════════════════════╤═════════════╤═══════════╤══════════════╕
│    │ name                                              │ trainable   │   n_train │   n_nontrain │
╞════╪═══════════════════════════════════════════════════╪═════════════╪═══════════╪══════════════╡
│  0 │ physicalcnn-ci (Functional)                       │ True        │     61128 │          310 │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  1 │ ― input_sp (InputLayer)                           │ True        │           │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  1 │ ― insert_channel_axis (InsertChannelAxis_)        │ True        │           │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  1 │ ― split (Split_)                                  │ True        │           │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  1 │ ― denoise3b (Functional)                          │ True        │     61128 │          114 │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  2 │ ――― denoise3b/bm1 (InputLayer)                    │ True        │           │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  2 │ ――― denoise3b/bm2 (InputLayer)                    │ True        │           │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  2 │ ――― denoise3b/bm3 (InputLayer)                    │ True        │           │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  2 │ ――― encoder (Sequential)                          │ True        │     55737 │           72 │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  3 │ ――――― encoder/b1 (Sequential)                     │ True        │     49225 │           32 │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  4 │ ――――――― encoder/b1/sconv (SeparableConv2D)        │ True        │        41 │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  4 │ ――――――― encoder/b1/batchnorm (BatchNormalization) │ True        │        32 │           32 │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  4 │ ――――――― encoder/b1/prelu (PReLU)                  │ True        │     49152 │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  4 │ ――――――― encoder/b1/maxpool (MaxPooling2D)         │ True        │           │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  3 │ ――――― encoder/b2 (Sequential)                     │ True        │      3292 │            8 │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  4 │ ――――――― encoder/b2/sconv (SeparableConv2D)        │ True        │       212 │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  4 │ ――――――― encoder/b2/batchnorm (BatchNormalization) │ True        │         8 │            8 │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  4 │ ――――――― encoder/b2/prelu (PReLU)                  │ True        │      3072 │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  4 │ ――――――― encoder/b2/maxpool (MaxPooling2D)         │ True        │           │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  3 │ ――――― encoder/b3 (Sequential)                     │ True        │      3220 │           32 │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  4 │ ――――――― encoder/b3/sconv (SeparableConv2D)        │ True        │       116 │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  4 │ ――――――― encoder/b3/batchnorm (BatchNormalization) │ True        │        32 │           32 │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  4 │ ――――――― encoder/b3/prelu (PReLU)                  │ True        │      3072 │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  4 │ ――――――― encoder/b3/maxpool (MaxPooling2D)         │ True        │           │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  2 │ ――― decoder (Sequential)                          │ True        │      5391 │           42 │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  3 │ ――――― decoder/b1 (Sequential)                     │ True        │       780 │            8 │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  4 │ ――――――― decoder/b1/convt (Conv2DTranspose)        │ True        │       580 │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  4 │ ――――――― decoder/b1/batchnorm (BatchNormalization) │ True        │         8 │            8 │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  4 │ ――――――― decoder/b1/prelu (PReLU)                  │ True        │       192 │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  4 │ ――――――― decoder/b1/upsample (UpSampling2D)        │ True        │           │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  3 │ ――――― decoder/b2 (Sequential)                     │ True        │      3696 │           32 │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  4 │ ――――――― decoder/b2/convt (Conv2DTranspose)        │ True        │       592 │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  4 │ ――――――― decoder/b2/batchnorm (BatchNormalization) │ True        │        32 │           32 │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  4 │ ――――――― decoder/b2/prelu (PReLU)                  │ True        │      3072 │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  4 │ ――――――― decoder/b2/upsample (UpSampling2D)        │ True        │           │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  3 │ ――――― decoder/b3 (Sequential)                     │ True        │       915 │            2 │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  4 │ ――――――― decoder/b3/convt (Conv2DTranspose)        │ True        │       145 │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  4 │ ――――――― decoder/b3/batchnorm (BatchNormalization) │ True        │         2 │            2 │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  4 │ ――――――― decoder/b3/prelu (PReLU)                  │ True        │       768 │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  4 │ ――――――― decoder/b3/upsample (UpSampling2D)        │ True        │           │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  2 │ ――― sigmoid_mask (Sigmoid_)                       │ True        │           │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  2 │ ――― recorder_mask (Recorder_)                     │ True        │           │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  2 │ ――― masking (Mask_)                               │ True        │           │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  2 │ ――― recorder_cbm (Recorder_)                      │ True        │           │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  1 │ ― continuity (MaskContinuity_)                    │ True        │           │            1 │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  1 │ ― identity (MaskIdentity_)                        │ True        │           │            1 │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  1 │ ― input_rs (InputLayer)                           │ True        │           │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  1 │ ― classifier3b (Functional)                       │ False       │           │          194 │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  2 │ ――― classifier3b/bm1 (InputLayer)                 │ False       │           │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  2 │ ――― classifier3b/rs (InputLayer)                  │ False       │           │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  2 │ ――― classifier3b/bm2 (InputLayer)                 │ False       │           │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  2 │ ――― classifier3b/bm3 (InputLayer)                 │ False       │           │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  2 │ ――― spectrum (Spectrum_)                          │ False       │           │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  2 │ ――― shift_sns (ShiftSNS_)                         │ False       │           │           96 │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  2 │ ――― recorder_bs (Recorder_)                       │ False       │           │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  2 │ ――― recorder_sns (Recorder_)                      │ False       │           │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  2 │ ――― subtract (Subtract)                           │ False       │           │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  2 │ ――― relu_residual (ReLU_)                         │ False       │           │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  2 │ ――― recorder_residual (Recorder_)                 │ False       │           │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  2 │ ――― weighted_sum (WeightedSum_)                   │ False       │           │           96 │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  2 │ ――― recorder_avg_residual (Recorder_)             │ False       │           │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  2 │ ――― s_function (SFunction_)                       │ False       │           │            2 │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  2 │ ――― recorder_probability (Recorder_)              │ False       │           │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  1 │ ― any_of_3 (AnyOf3_)                              │ True        │           │              │
╘════╧═══════════════════════════════════════════════════╧═════════════╧═══════════╧══════════════╛
done
>> fit...
done

history saved!
plot saved!


Testing------
loss: 0.2148 - accuracy: 0.9435 - recall: 0.9874 - precision: 0.9372 - f1_score: 0.9617

2021-06-08_20:31:21 [Shutdown loggers]
