subset_id_path: ./subset_id/2015~2020-07-03.json
datasetDirs: ['./dataset/2015~2016/detect/', './dataset/2017-08-02/detect/', './dataset/2017-10-25/detect/', './dataset/2020-06-03/detect/', './dataset/2020-07-03/detect/']
walk: False
cutin_freq: 4000
spect_shape: (96, 96)
modelname: PhysicalCNN
modelfolder_path: ./{PhysicalCNN}/
loglevel: INFO
logpath: ./{PhysicalCNN}/logs/*.txt

DTYPE: float32
DATA_FORMAT: channels_last
BATCH_SIZE: 128
EPOCHS: 1000

1 Physical GPUs, 1 Logical GPUs

[train]
number of classes: 2
number of data: 4031
number of data in each class: {0 = 1252, 1 = 2779}
ratios of classes: {0 = 0.3106, 1 = 0.6894}
class_weight: {0 = 1.6098, 1 = 0.7253}

[valid]
number of classes: 2
number of data: 1330
number of data in each class: {0 = 555, 1 = 775}
ratios of classes: {0 = 0.4173, 1 = 0.5827}
class_weight: {0 = 1.1982, 1 = 0.8581}

[test]
number of classes: 2
number of data: 1663
number of data in each class: {0 = 469, 1 = 1194}
ratios of classes: {0 = 0.2820, 1 = 0.7180}
class_weight: {0 = 1.7729, 1 = 0.6964}


Training----------------
>> build model... 
Model: "physicalcnn"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_sp (InputLayer)           [(None, 96, 96)]     0                                            
__________________________________________________________________________________________________
insert_channel_axis (InsertChan (None, 96, 96, 1)    0           input_sp[0][0]                   
__________________________________________________________________________________________________
split (Split_)                  [(None, 96, 32, 1),  0           insert_channel_axis[0][0]        
__________________________________________________________________________________________________
denoise3b (Functional)          [(None, 96, 32, 1),  9294        split[0][0]                      
                                                                 split[0][1]                      
                                                                 split[0][2]                      
__________________________________________________________________________________________________
input_rs (InputLayer)           [(None,)]            0                                            
__________________________________________________________________________________________________
classifier3b (Functional)       [(None,), (None,), ( 194         denoise3b[0][0]                  
                                                                 denoise3b[0][1]                  
                                                                 denoise3b[0][2]                  
                                                                 input_rs[0][0]                   
__________________________________________________________________________________________________
any_of_3 (AnyOf3_)              (None,)              0           classifier3b[0][0]               
                                                                 classifier3b[0][1]               
                                                                 classifier3b[0][2]               
==================================================================================================
Total params: 9,488
Trainable params: 9,132
Non-trainable params: 356
__________________________________________________________________________________________________
╒════╤═══════════════════════════════════════════════════╤═════════════╤═══════════╤══════════════╕
│    │ name                                              │ trainable   │   n_train │   n_nontrain │
╞════╪═══════════════════════════════════════════════════╪═════════════╪═══════════╪══════════════╡
│  0 │ physicalcnn (Functional)                          │ True        │      9132 │          356 │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  1 │ ― input_sp (InputLayer)                           │ True        │           │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  1 │ ― insert_channel_axis (InsertChannelAxis_)        │ True        │           │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  1 │ ― split (Split_)                                  │ True        │           │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  1 │ ― denoise3b (Functional)                          │ True        │      9132 │          162 │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  2 │ ――― denoise3b/bm1 (InputLayer)                    │ True        │           │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  2 │ ――― denoise3b/bm2 (InputLayer)                    │ True        │           │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  2 │ ――― denoise3b/bm3 (InputLayer)                    │ True        │           │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  2 │ ――― encoder (Sequential)                          │ True        │      3657 │           96 │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  3 │ ――――― encoder/b1 (Sequential)                     │ True        │      1609 │           32 │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  4 │ ――――――― encoder/b1/sconv (SeparableConv2D)        │ True        │        41 │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  4 │ ――――――― encoder/b1/batchnorm (BatchNormalization) │ True        │        32 │           32 │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  4 │ ――――――― encoder/b1/prelu (PReLU)                  │ True        │      1536 │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  4 │ ――――――― encoder/b1/maxpool (MaxPooling2D)         │ True        │           │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  3 │ ――――― encoder/b2 (Sequential)                     │ True        │      1216 │           32 │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  4 │ ――――――― encoder/b2/sconv (SeparableConv2D)        │ True        │       416 │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  4 │ ――――――― encoder/b2/batchnorm (BatchNormalization) │ True        │        32 │           32 │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  4 │ ――――――― encoder/b2/prelu (PReLU)                  │ True        │       768 │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  4 │ ――――――― encoder/b2/maxpool (MaxPooling2D)         │ True        │           │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  3 │ ――――― encoder/b3 (Sequential)                     │ True        │       832 │           32 │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  4 │ ――――――― encoder/b3/sconv (SeparableConv2D)        │ True        │       416 │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  4 │ ――――――― encoder/b3/batchnorm (BatchNormalization) │ True        │        32 │           32 │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  4 │ ――――――― encoder/b3/prelu (PReLU)                  │ True        │       384 │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  4 │ ――――――― encoder/b3/maxpool (MaxPooling2D)         │ True        │           │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  2 │ ――― decoder (Sequential)                          │ True        │      5475 │           66 │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  3 │ ――――― decoder/b1 (Sequential)                     │ True        │      2544 │           32 │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  4 │ ――――――― decoder/b1/convt (Conv2DTranspose)        │ True        │      2320 │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  4 │ ――――――― decoder/b1/batchnorm (BatchNormalization) │ True        │        32 │           32 │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  4 │ ――――――― decoder/b1/prelu (PReLU)                  │ True        │       192 │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  4 │ ――――――― decoder/b1/upsample (UpSampling2D)        │ True        │           │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  3 │ ――――― decoder/b2 (Sequential)                     │ True        │      2736 │           32 │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  4 │ ――――――― decoder/b2/convt (Conv2DTranspose)        │ True        │      2320 │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  4 │ ――――――― decoder/b2/batchnorm (BatchNormalization) │ True        │        32 │           32 │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  4 │ ――――――― decoder/b2/prelu (PReLU)                  │ True        │       384 │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  4 │ ――――――― decoder/b2/upsample (UpSampling2D)        │ True        │           │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  3 │ ――――― decoder/b3 (Sequential)                     │ True        │       195 │            2 │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  4 │ ――――――― decoder/b3/convt (Conv2DTranspose)        │ True        │       145 │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  4 │ ――――――― decoder/b3/batchnorm (BatchNormalization) │ True        │         2 │            2 │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  4 │ ――――――― decoder/b3/prelu (PReLU)                  │ True        │        48 │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  4 │ ――――――― decoder/b3/upsample (UpSampling2D)        │ True        │           │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  2 │ ――― sigmoid_mask (Sigmoid_)                       │ True        │           │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  2 │ ――― recorder_mask (Recorder_)                     │ True        │           │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  2 │ ――― masking (Mask_)                               │ True        │           │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  2 │ ――― recorder_cbm (Recorder_)                      │ True        │           │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  1 │ ― input_rs (InputLayer)                           │ True        │           │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  1 │ ― classifier3b (Functional)                       │ False       │           │          194 │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  2 │ ――― classifier3b/bm1 (InputLayer)                 │ False       │           │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  2 │ ――― classifier3b/rs (InputLayer)                  │ False       │           │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  2 │ ――― classifier3b/bm2 (InputLayer)                 │ False       │           │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  2 │ ――― classifier3b/bm3 (InputLayer)                 │ False       │           │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  2 │ ――― spectrum (Spectrum_)                          │ False       │           │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  2 │ ――― shift_sns (ShiftSNS_)                         │ False       │           │           96 │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  2 │ ――― recorder_bs (Recorder_)                       │ False       │           │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  2 │ ――― recorder_sns (Recorder_)                      │ False       │           │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  2 │ ――― subtract (Subtract)                           │ False       │           │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  2 │ ――― relu_residual (ReLU_)                         │ False       │           │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  2 │ ――― recorder_residual (Recorder_)                 │ False       │           │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  2 │ ――― weighted_sum (WeightedSum_)                   │ False       │           │           96 │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  2 │ ――― recorder_avg_residual (Recorder_)             │ False       │           │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  2 │ ――― s_function (SFunction_)                       │ False       │           │            2 │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  2 │ ――― recorder_probability (Recorder_)              │ False       │           │              │
├────┼───────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  1 │ ― any_of_3 (AnyOf3_)                              │ True        │           │              │
╘════╧═══════════════════════════════════════════════════╧═════════════╧═══════════╧══════════════╛
done
>> fit...
done
history saved!
plot saved!


Testing------
loss: 0.1732 - accuracy: 0.9711 - recall: 0.9883 - precision: 0.9720 - f1_score: 0.9801

2021-06-19_16:32:51 [Shutdown loggers]
