subset_id_path: ./subset_id/2015~2020-07-03.json
datasetDirs: ['./dataset/2015~2016/detect/', './dataset/2017-08-02/detect/', './dataset/2017-10-25/detect/', './dataset/2020-06-03/detect/', './dataset/2020-07-03/detect/']
walk: False
cutin_freq: 4000
spect_shape: (96, 96)
modelname: SimpleCNN
modelfolder_path: ./{SimpleCNN}/
stage1_weights_path: 
loglevel: INFO
logpath: ./{SimpleCNN}/logs/*.txt

DTYPE: float32
DATA_FORMAT: channels_last
BATCH_SIZE: 128
EPOCHS: 1000

1 Physical GPUs, 1 Logical GPUs

[train]
number of classes: 2
number of data: 4031
number of data in each class: {0 = 1252, 1 = 2779}
ratios of classes: {0 = 0.3106, 1 = 0.6894}
class_weight: {0 = 1.6098, 1 = 0.7253}

[valid]
number of classes: 2
number of data: 1330
number of data in each class: {0 = 555, 1 = 775}
ratios of classes: {0 = 0.4173, 1 = 0.5827}
class_weight: {0 = 1.1982, 1 = 0.8581}

[test]
number of classes: 2
number of data: 1663
number of data in each class: {0 = 469, 1 = 1194}
ratios of classes: {0 = 0.2820, 1 = 0.7180}
class_weight: {0 = 1.7729, 1 = 0.6964}


Training----------------
>> build model... 
Model: "simplecnn"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_sp (InputLayer)        [(None, 96, 96)]          0         
_________________________________________________________________
featurewise_std (Normalizati (None, 96, 96)            18433     
_________________________________________________________________
insert_channel_axis (InsertC (None, 96, 96, 1)         0         
_________________________________________________________________
blocks (Sequential)          (None, 12, 12, 16)        7680      
_________________________________________________________________
globalavgpool (GlobalAverage (None, 16)                0         
_________________________________________________________________
dense (Dense)                (None, 16)                272       
_________________________________________________________________
fc_batchnorm (BatchNormaliza (None, 16)                64        
_________________________________________________________________
fc_dropout (Dropout)         (None, 16)                0         
_________________________________________________________________
fc_prelu (PReLU)             (None, 16)                1         
_________________________________________________________________
dense_out (Dense)            (None, 1)                 17        
_________________________________________________________________
probability (Sigmoid_)       (None, 1)                 0         
=================================================================
Total params: 26,467
Trainable params: 7,906
Non-trainable params: 18,561
_________________________________________________________________
╒════╤════════════════════════════════════════════════╤═════════════╤═══════════╤══════════════╕
│    │ name                                           │ trainable   │   n_train │   n_nontrain │
╞════╪════════════════════════════════════════════════╪═════════════╪═══════════╪══════════════╡
│  0 │ simplecnn (Functional)                         │ True        │      7906 │        18561 │
├────┼────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  1 │ ― input_sp (InputLayer)                        │ True        │           │              │
├────┼────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  1 │ ― featurewise_std (Normalization)              │ True        │           │        18433 │
├────┼────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  1 │ ― insert_channel_axis (InsertChannelAxis_)     │ True        │           │              │
├────┼────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  1 │ ― blocks (Sequential)                          │ True        │      7584 │           96 │
├────┼────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  2 │ ――― blocks/b1 (Sequential)                     │ True        │      1728 │           32 │
├────┼────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  3 │ ――――― blocks/b1/conv (Conv2D)                  │ True        │       160 │              │
├────┼────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  3 │ ――――― blocks/b1/batchnorm (BatchNormalization) │ True        │        32 │           32 │
├────┼────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  3 │ ――――― blocks/b1/prelu (PReLU)                  │ True        │      1536 │              │
├────┼────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  3 │ ――――― blocks/b1/maxpool (MaxPooling2D)         │ True        │           │              │
├────┼────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  2 │ ――― blocks/b2 (Sequential)                     │ True        │      3120 │           32 │
├────┼────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  3 │ ――――― blocks/b2/conv (Conv2D)                  │ True        │      2320 │              │
├────┼────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  3 │ ――――― blocks/b2/batchnorm (BatchNormalization) │ True        │        32 │           32 │
├────┼────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  3 │ ――――― blocks/b2/prelu (PReLU)                  │ True        │       768 │              │
├────┼────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  3 │ ――――― blocks/b2/maxpool (MaxPooling2D)         │ True        │           │              │
├────┼────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  2 │ ――― blocks/b3 (Sequential)                     │ True        │      2736 │           32 │
├────┼────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  3 │ ――――― blocks/b3/conv (Conv2D)                  │ True        │      2320 │              │
├────┼────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  3 │ ――――― blocks/b3/batchnorm (BatchNormalization) │ True        │        32 │           32 │
├────┼────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  3 │ ――――― blocks/b3/prelu (PReLU)                  │ True        │       384 │              │
├────┼────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  3 │ ――――― blocks/b3/maxpool (MaxPooling2D)         │ True        │           │              │
├────┼────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  1 │ ― globalavgpool (GlobalAveragePooling2D)       │ True        │           │              │
├────┼────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  1 │ ― dense (Dense)                                │ True        │       272 │              │
├────┼────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  1 │ ― fc_batchnorm (BatchNormalization)            │ True        │        32 │           32 │
├────┼────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  1 │ ― fc_dropout (Dropout)                         │ True        │           │              │
├────┼────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  1 │ ― fc_prelu (PReLU)                             │ True        │         1 │              │
├────┼────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  1 │ ― dense_out (Dense)                            │ True        │        17 │              │
├────┼────────────────────────────────────────────────┼─────────────┼───────────┼──────────────┤
│  1 │ ― probability (Sigmoid_)                       │ True        │           │              │
╘════╧════════════════════════════════════════════════╧═════════════╧═══════════╧══════════════╛
done
>> fit...
done
history saved!
plot saved!


Testing------
loss: 0.2803 - accuracy: 0.9417 - recall: 0.9271 - precision: 0.9910 - f1_score: 0.9580

2021-06-08_21:15:25 [Shutdown loggers]
